fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Catalog.ДоговорыКонтрагентов</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ОбработкаЗаказов/ОбработкаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбработкаЗаказов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОтгрузкиРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ВидыРаботПоЗаявкамКлиентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
	//++ВКМ_Дроздков_03.07.24
	
	Если  ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗаполнитьНаОснованииДоговораКонтрагента(ДанныеЗаполнения);	
	КонецЕсли;
	
	//--
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ++14.07.24 ВКМ_Дроздков
	СтоимостьРаботСпециалиста = РассчитатьСтоимостьРаботСпециалиста();
	//--
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;
	// ++14.07.24 ВКМ_Дроздков
	Движение.СуммаОтгрузкиРаботыСпециалиста = СтоимостьРаботСпециалиста;
	//--
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//++ Дроздков_ВКМ 24.06.24
#Область ВКМ_Доработки

Процедура ЗаполнитьНаОснованииДоговораКонтрагента(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Основание = ДанныеЗаполнения.Ссылка;
	Контрагент = ДанныеЗаполнения.Владелец;
	Комментарий = "Документ создан автоматически";
	Договор = ДанныеЗаполнения.Ссылка;
	
КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт

	АбонентскаяПлатаПоДоговору = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	ВыполненныеРаботыПоДоговору = Константы.ВКМ_НоменклатураВыполненныеРаботы.Получить();	
	ЗаполнятьАбонентскуюПлату = Ложь;
	ЗаполнятьВыполненныеРаботы = Ложь;
		
	Если ЗначениеЗаполнено(АбонентскаяПлатаПоДоговору) И ЗначениеЗаполнено(ВыполненныеРаботыПоДоговору) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_РазмерАбоненсткойПлаты КАК РазмерАбоненсткойПлаты
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
		
		Запрос.УстановитьПараметр("Договор", Договор);
		ТЗПараметрыДоговора = Запрос.Выполнить().Выгрузить();
		АбонентскаяПлатаПоДоговору = ТЗПараметрыДоговора.ВыгрузитьКолонку("РазмерАбоненсткойПлаты")[0];
		
		Если АбонентскаяПлатаПоДоговору > 0 Тогда
			
			ЗаполнятьАбонентскуюПлату = Истина;

		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов КАК КоличествоЧасов,
		|	ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате КАК СуммаКОплате,
		|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|ГДЕ
		|	ВКМ_ВыполненныеКлиентуРаботы.Клиент = &Клиент
		|	И ВКМ_ВыполненныеКлиентуРаботы.Период <= &КонецМесяца
		|	И ВКМ_ВыполненныеКлиентуРаботы.Период >= &НачалоМесяца
		|ИТОГИ
		|	СУММА(СуммаКОплате),
		|	СУММА(КоличествоЧасов)
		|ПО
		|	Договор";
		
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("Клиент", Контрагент);
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		
		ТЗВыполненныеРаботы = Запрос.Выполнить().Выгрузить();
		
		Если ТЗВыполненныеРаботы.Количество() > 0 Тогда
		
			ЗаполнятьВыполненныеРаботы = Истина;
			СуммаПоВыполненнымРаботам = ТЗВыполненныеРаботы.ВыгрузитьКолонку("СуммаКОплате")[0];
			СуммаЧасов = ТЗВыполненныеРаботы.ВыгрузитьКолонку("КоличествоЧасов")[0];
			
		КонецЕсли;
		
		Если 
		
		ЗаполнятьАбонентскуюПлату = Истина 
		ИЛИ ЗаполнятьВыполненныеРаботы = Истина 
		
		Тогда
			
		ЭтотОбъект.Услуги.Очистить();
		ЗаполнитьСтрокиТЧ(АбонентскаяПлатаПоДоговору, СуммаПоВыполненнымРаботам, ЗаполнятьВыполненныеРаботы, СуммаЧасов);
		
		Иначе 
			
			ОбщегоНазначения.СообщитьПользователю("Данные для заполнения отсутствуют");
		
		КонецЕсли;
					
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Не заданы значения констант. Обратитесь к администратору системы.");
			
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиТЧ(АбонентскаяПлатаПоДоговору, СуммаПоВыполненнымРаботам, ЗаполнятьВыполненныеРаботы, СуммаЧасов)

	СтрокаАбонентскаяПлата = ЭтотОбъект.Услуги.Добавить();
	СтрокаАбонентскаяПлата.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	СтрокаАбонентскаяПлата.Количество = 1;
	СтрокаАбонентскаяПлата.Цена = АбонентскаяПлатаПоДоговору;
	СтрокаАбонентскаяПлата.Сумма = СтрокаАбонентскаяПлата.Цена * СтрокаАбонентскаяПлата.Количество;

	Если ЗаполнятьВыполненныеРаботы = Истина Тогда
	
	СтрокаВыполненныеРаботы = ЭтотОбъект.Услуги.Добавить();
	СтрокаВыполненныеРаботы.Номенклатура = Константы.ВКМ_НоменклатураВыполненныеРаботы.Получить();
	СтрокаВыполненныеРаботы.Количество = СуммаЧасов;
	СтрокаВыполненныеРаботы.Сумма = СуммаПоВыполненнымРаботам;
	СтрокаВыполненныеРаботы.Цена = СуммаПоВыполненнымРаботам/СуммаЧасов;
		
	КонецЕсли;
	
	ЭтотОбъект.Записать();
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Таблица услуг в документе %1 успешно заполнена.",ЭтотОбъект.Номер));	
		
КонецПроцедуры

Функция РассчитатьСтоимостьРаботСпециалиста()
	
	СтоимостьРаботСпециалиста = 0;
	
	Для каждого Строка Из Услуги Цикл
		
		Если Строка.Номенклатура = Константы.ВКМ_НоменклатураВыполненныеРаботы.Получить() Тогда
		
			СтоимостьРаботСпециалиста = СтоимостьРаботСпециалиста + Строка.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтоимостьРаботСпециалиста;
	
КонецФункции

#КонецОбласти
//--

#КонецЕсли
